datasets/cfdBase/baseCaseLowRe/level0/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 9.6e-08; // 

boundaryField
{
    Left
    {
      type             inletOutlet; 
      inletValue       uniform 9.6e-08;
    }

    Upper
    {
      type             inletOutlet; 
      inletValue       uniform 9.6e-08;
    }

    Lower
    {
      type             inletOutlet; 
      inletValue       uniform 9.6e-08;
    }

    Right
    {
      type              zeroGradient;
    }


    Side
    {
        type            empty;
    }

    Object
    {
      type            fixedValue;
      value           uniform 1e-11; 
    } 
}

// ************************************************************************* //
