datasets/cfdBase/baseCaseLowRe/level0/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform  1e-8;

boundaryField
{
    Left
    {
      type            calculated; 
      value           uniform 0;
    }

      Upper
    {
      type            calculated; 
      value           uniform 0;
    }

      Lower
    {
      type            calculated; 
      value           uniform 0;
    }

    Right
    {
      type            zeroGradient;
    }


    Side
    {
        type            empty;
    }

    Object
    {
      type            calculated; 
      value           uniform 0;
    }
}


// ************************************************************************* //
