datasets/cfdBase/baseCaseLowRe/level0/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Left 
    {
      type              zeroGradient;
    }

    Upper 
    {
      type              zeroGradient;
    }

    Lower 
    {
      type              zeroGradient;
    }

    Right
    {

      type             fixedValue;
      value           uniform 0;
    }


    Side
    {
        type            empty;
    }

    Object 
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
